# Taps
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/services'

# ------------------------------------------------------------------------------
# Command line interface from brew
# ------------------------------------------------------------------------------

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install Utilities
brew 'coreutils'
brew 'findutils'
brew 'bash'
brew 'grep'
brew 'telnet'

# Binaries
brew 'ack'
brew 'git'
brew 'graphviz'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'wget'
brew 'tldr'
brew 'autojump'

# Node
brew 'node'
brew 'nvm'
brew 'yarn'

# PHP
brew 'composer'
brew 'php72', args: ['with-pear']
brew 'php-code-sniffer'
brew 'pkg-config'
brew 'imagemagick'

# Database & servers
brew 'dnsmasq'
brew 'mariadb'
brew 'nginx'
brew 'redis'
brew 'sqlite'

# ------------------------------------------------------------------------------
# Applications from brew cask
# ------------------------------------------------------------------------------

# Utils
cask 'alfred'
cask 'avibrazil-rdm'
cask 'bartender'
cask 'caffeine'
cask 'daisydisk'
cask 'deckset'
cask 'flux'
cask 'numi'
cask 'screenflow'
cask 'sip'
cask 'kap'

# Browsers and drives
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'

# Editors and git management
cask 'github'
cask 'sublime-text'
cask 'visual-studio-code'

# Development
cask 'docker'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'postman'
cask 'sequel-pro'

# Others
cask 'dofus'
cask 'signal'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'vlc'
cask 'whatsapp'

# ------------------------------------------------------------------------------
# Applications from Mac App Store
# ------------------------------------------------------------------------------

mas '1Password', id: 1333542190
mas 'Bear', id: 1091189122
mas 'Magnet', id: 441258766
mas 'Spark', id: 1176895641
mas 'Trello', id: 1278508951
mas 'Unsplash Wallpapers', id: 1284863847