# Taps
tap 'blendle/blendle'
tap 'homebrew/bundle'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap 'shivammathur/php'
tap 'withgraphite/tap'

# ------------------------------------------------------------------------------
# Command line interface from brew
# ------------------------------------------------------------------------------

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install Utilities
brew 'coreutils'
brew 'findutils'
brew 'bash'
brew 'gifski'
brew 'grep'
brew 'telnet'

# Binaries
brew 'ack'
brew 'autojump'
brew 'bat'
brew 'dasel'
brew 'doctl'
brew 'fzf'
brew 'flock'
brew 'gh'
brew 'git'
brew 'gnu-tar'
brew 'gnupg'
brew 'gpg'
brew 'graphviz'
brew 'helm'
brew 'httpie'
brew 'hugo'
brew 'jq'
brew 'kns'
brew 'mas'
brew 'openssl@3'
brew 'pidof'
brew 'pinentry-mac'
brew 'prettyping'
brew 'pure'
brew 'stern'
brew 'thefuck'
brew 'tldr'
brew 'tmux'
brew 'tmuxinator'
brew 'tree'
brew 'watch'
brew 'withgraphite/tap/graphite'
brew 'wget'

# PHP
brew 'composer'
brew 'shivammathur/php/php@8.0'
brew 'php@8.1'
brew 'php@8.2'
brew 'php-code-sniffer'
brew 'pkg-config'
brew 'imagemagick'

# Development
brew 'nvm'
brew 'pnpm'
brew 'yarn'

# Database & servers
brew 'ansible'
brew 'dnsmasq'
brew 'mysql'
brew 'nginx'
brew 'rabbitmq'
brew 'redis'
brew 'sqlite'

# ------------------------------------------------------------------------------
# Applications from brew cask
# ------------------------------------------------------------------------------

# Utils
cask 'bartender'
cask 'cleanshot'
cask 'daisydisk'
cask "elgato-control-center"
cask 'flux'
cask 'gpg-suite'
cask 'imageoptim'
cask 'moom'
cask 'numi'
cask 'pixelsnap'
cask 'raycast'
cask 'screenflow'

# Browsers and drives
cask 'arc'
cask 'firefox'
cask 'google-chrome'

# Productivity
cask 'anylist'
cask 'notion'

# Editors and git management
cask 'github'
cask 'jetbrains-toolbox'
cask 'sublime-text'
cask 'visual-studio-code'

# Development
cask 'docker'
cask 'dbngin'
cask 'insomnia'
cask 'iterm2'
cask 'ngrok'
cask 'postman'
cask 'tableplus'

# Graphic design
cask 'figma'
cask 'sip'

# Communication
cask 'discord'
cask 'signal'
cask 'slack'
cask 'telegram'
cask 'whatsapp'
cask 'zoom'

# Others
cask 'spotify'
cask 'vlc'

# ------------------------------------------------------------------------------
# Applications from Mac App Store
# ------------------------------------------------------------------------------

mas 'Bear', id: 1091189122
mas 'Spark Desktop', id: 6445813049
