# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap 'blendle/blendle'
tap 'mongodb/brew'

# ------------------------------------------------------------------------------
# Command line interface from brew
# ------------------------------------------------------------------------------

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'fish'

# Install Utilities
brew 'coreutils'
brew 'findutils'
brew 'bash'
brew 'grep'
brew 'telnet'
brew 'unrar'

# Binaries
brew 'ack'
brew 'ansible'
brew 'autojump'
brew 'bat'
brew 'doctl'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'graphviz'
brew 'helm'
brew 'httpie'
brew 'hugo'
brew 'kns'
brew 'mas'
brew 'prettyping'
brew 'stern'
brew 'thefuck'
brew 'tldr'
brew 'tmux'
brew 'tmuxinator'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'yarn'

# PHP
brew 'composer'
brew 'php@7.3'
brew 'php@7.4'
brew 'php-code-sniffer'
brew 'pkg-config'
brew 'imagemagick'

# Database & servers
brew 'dnsmasq'
brew 'mongodb-community@4.2'
brew 'mysql@5.7'
brew 'nginx'
brew 'rabbitmq'
brew 'redis'
brew 'sqlite'

# ------------------------------------------------------------------------------
# Applications from brew cask
# ------------------------------------------------------------------------------

# Utils
cask '1password'
cask 'alfred'
cask 'amethyst'
cask 'avibrazil-rdm'
cask 'bartender'
cask 'cheatsheet'
cask 'daisydisk'
cask 'flux'
cask 'gpg-suite'
cask 'kap'
cask 'numi'
cask 'rocket'
cask 'screenflow'

# Browsers and drives
cask 'firefox'
cask 'insync'
cask 'google-chrome'

# Productivity
cask 'anylist'
cask 'notion'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'

# Editors and git management
cask 'github'
cask 'gitkraken'
cask 'phpstorm'
cask 'sublime-text'
cask 'tower'
cask 'visual-studio-code'

# Development
cask 'docker'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'postman'
cask 'sequel-pro'

# Graphic design
cask 'figma'
cask 'sip'

# Communication
cask 'signal'
cask 'skype'
cask 'slack'
cask 'twist'
cask 'whatsapp'

# Others
cask 'boom-3d'
cask 'spotify'
cask 'vlc'

# ------------------------------------------------------------------------------
# Applications from Mac App Store
# ------------------------------------------------------------------------------

mas 'Bear', id: 1091189122
mas 'Magnet', id: 441258766
mas 'Spark', id: 1176895641
mas 'Trello', id: 1278508951
mas 'Unsplash Wallpapers', id: 1284863847
